In [9]:
import pandas as pd
import numpy as np

In [10]:
a = ["matt", "kate", "lopard", "josh"]
b = [10, 12, 11, 13]
df = pd.DataFrame(a, b)
df

         0
10    matt
12    kate
11  lopard
13    josh

In [11]:
reset = df.reset_index()
reset.columns = ["age", "names"]
reset

   age   names
0   10    matt
1   12    kate
2   11  lopard
3   13    josh

In [12]:
df2 = pd.DataFrame([a, b]).T
df2.columns = ["names", "age"]
df2

    names age
0    matt  10
1    kate  12
2  lopard  11
3    josh  13

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
###series

In [15]:
sdf = pd.Series(a)
sdf

0      matt
1      kate
2    lopard
3      josh
dtype: object

In [16]:
type(sdf)

pandas.core.series.Series

In [17]:
df2["names"].values

array(['matt', 'kate', 'lopard', 'josh'], dtype=object)

In [18]:
df2["names"]

0      matt
1      kate
2    lopard
3      josh
Name: names, dtype: object

In [19]:
df2["age"].values

array([10, 12, 11, 13], dtype=object)

In [20]:
df2.iloc[3].values

array(['josh', 13], dtype=object)

In [21]:
df2["age"].values

array([10, 12, 11, 13], dtype=object)

In [22]:
k = []
for i in df2["age"].values:
    if i >=10 and i <=11:
        k.append("give candy")
    else:
        k.append("dont give candy")
df2["candy_status"] = k

In [23]:
df2

    names age     candy_status
0    matt  10       give candy
1    kate  12  dont give candy
2  lopard  11       give candy
3    josh  13  dont give candy

In [24]:
path = "C:/Users/ABDULRASHID/Downloads/kaggle_data/credits.csv"

In [25]:
new_df = pd.read_csv(path)
new_df.head()

,cast,crew,id
0,"[{'cast_id': 14, 'character': 'Woody (voice)',...","[{'credit_id': '52fe4284c3a36847f8024f49', 'de...",862
1,"[{'cast_id': 1, 'character': 'Alan Parrish', '...","[{'credit_id': '52fe44bfc3a36847f80a7cd1', 'de...",8844
2,"[{'cast_id': 2, 'character': 'Max Goldman', 'c...","[{'credit_id': '52fe466a9251416c75077a89', 'de...",15602
3,"[{'cast_id': 1, 'character': ""Savannah 'Vannah...","[{'credit_id': '52fe44779251416c91011acb', 'de...",31357
4,"[{'cast_id': 1, 'character': 'George Banks', '...","[{'credit_id': '52fe44959251416c75039ed7', 'de...",11862

In [26]:
df_new = new_df.sample(n=500)
df_new.shape

(500, 3)

In [27]:
df_new.head()

,cast,crew,id
4479,"[{'cast_id': 2, 'character': 'Virgil Cane', 'c...","[{'credit_id': '52fe45cec3a368484e06ff5b', 'de...",29185
19120,"[{'cast_id': 4, 'character': 'Bruise Brubaker'...","[{'credit_id': '52fe44a5c3a368484e02ee99', 'de...",24729
7848,"[{'cast_id': 9, 'character': 'Herb', 'credit_i...","[{'credit_id': '52fe4417c3a368484e00ef49', 'de...",21386
30756,"[{'cast_id': 1, 'character': 'Madison', 'credi...",[],19212
21568,"[{'cast_id': 2, 'character': 'Zola', 'credit_i...","[{'credit_id': '52fe4af9c3a368484e170d5b', 'de...",127451

In [28]:
kb = df_new.reset_index().drop("index", axis=1)
kb

,cast,crew,id
0,"[{'cast_id': 2, 'character': 'Virgil Cane', 'c...","[{'credit_id': '52fe45cec3a368484e06ff5b', 'de...",29185
1,"[{'cast_id': 4, 'character': 'Bruise Brubaker'...","[{'credit_id': '52fe44a5c3a368484e02ee99', 'de...",24729
2,"[{'cast_id': 9, 'character': 'Herb', 'credit_i...","[{'credit_id': '52fe4417c3a368484e00ef49', 'de...",21386
3,"[{'cast_id': 1, 'character': 'Madison', 'credi...",[],19212
4,"[{'cast_id': 2, 'character': 'Zola', 'credit_i...","[{'credit_id': '52fe4af9c3a368484e170d5b', 'de...",127451
...,...,...,...
495,"[{'cast_id': 24, 'character': 'Shrek (voice)',...","[{'credit_id': '52fe4279c3a36847f802182b', 'de...",808
496,"[{'cast_id': 0, 'character': '', 'credit_id': ...","[{'credit_id': '540a2cd30e0a262b43000b61', 'de...",290695
497,"[{'cast_id': 15, 'character': 'Les Triplettes ...","[{'credit_id': '52fe4518c3a36847f80bc147', 'de...",9662
498,"[{'cast_id': 7, 'character': 'Billy Blazes', '...","[{'credit_id': '52fe486bc3a36847f81662af', 'de...",53516
499,"[{'cast_id': 8, 'character': 'Capt. Henri Roch...","[{'credit_id': '58bcb2f7925141607b044915', 'de...",23567

In [29]:
id_arr = kb["id"].values

In [31]:
#ast literal converts "[]" to a proper list
data_x = ast.literal_eval(kb["cast"].iloc[0])
data_x

NameError: name 'ast' is not defined

In [1]:
def handler(df, col, n):
    data = ast.literal_eval()

In [3]:
my_str = "Hello wolrd"

In [4]:
print(my_str)

Hello wolrd

In [ ]:
name = input("Hi! what is your name?")
print("Nice to meet you" + name + "!")

age = input("How old are you")
print("so, you are already" + str(age) + "years old" + name + "!")

In [ ]:
def naem():

In [ ]:
def naem():
    print("what's your name")

In [ ]:
name.py
def name():
    print("what's your name")